ADODG3_CFD_Only_HiSA_Transonic/0.orig/include/freestreamConditions
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|    HiSA: High Speed Aerodynamic solver                                      |
|    Copyright (C) 2014-2017 Johan Heyns - CSIR, South Africa                 |
|    Copyright (C) 2014-2017 Oliver Oxtoby - CSIR, South Africa               |
|                                                                             |
\*---------------------------------------------------------------------------*/

U             (239.116 20.5847 0);
p             101325.0;
T             300.0;
#inputMode    merge

// ************************************************************************* //
